// ### Тесты по Java: Введение и Основы

// #### Вопросы общего характера:

// 1. **В чем основное преимущество языка программирования Java?**
//    - c) Независимость от платформы

// 2. **Что означает принцип "Write once, run anywhere" в контексте Java?**
//    - b) Программы могут быть выполнены на любой платформе без изменений

// 3. **Когда был создан язык программирования Java?**
//    - b) 1995

// 4. **Что представляет собой "байт-код" в Java?**
//    - a) Исходный код программы

// #### Вопросы о программировании на Java:

// 5. **Какие шаги необходимы для установки Java Development Kit (JDK)?**
//    - d) Скачать и установить JDK с официального сайта Oracle

// 6. **Как создать программу "Hello World" на Java?**
//    - d) Использовать консоль для написания и выполнения кода по шагам

// 7. **Что выполняет команда `javac` в Java?**
//    - b) Компилирует Java-код в байт-код

// 8. **Как можно выполнить Java-программу после ее компиляции?**
//    - d) Ввести команду `java HelloWorld`

// #### Вопросы о консольном выводе и комментариях:

// 9. **Как вывести информацию в консоль на Java с новой строки?**
//    - c) `System.out.println("Hello");`

// 10. **Что представляет собой сборщик мусора (Garbage Collection) в Java?**
//     - b) Процесс автоматической очистки неиспользуемых объектов из памяти

// #### Вопросы о методе main и командной строке:

// 11. **Зачем используется метод `main` в Java?**
//     - b) Для определения основного функционала программы

// 12. **Как передать аргументы командной строки в программу Java через метод `main`?**
//     - a) Поместить аргументы в массив `args` и передать его в метод `main`
//     - b) Использовать команду `java -args MyProgram`
//     - c) Задать аргументы в файле конфигурации
//     - d) Ввести аргументы после команды `java MyProgram`

// #### Вопросы о JDK, JRE и JVM:

// 13. **Что представляет собой JDK в Java?**
//     - c) Набор инструментов для разработки Java-программ

// 14. **Какую функцию выполняет JRE в Java?**
//     - b) Выполняет Java-программы

// 15. **Что такое JVM в контексте Java?**
//     - a) Виртуальная машина Java для выполнения скомпилированного кода

// ####

//  Вопросы о платформах Java и Classpath:

// 16. **В чем различие между Java SE, Java EE и Java ME?**
//     - c) Все три платформы ориентированы на разные типы приложений

// 17. **Что такое Classpath в Java?**
//     - b) Путь для поиска классов и ресурсов во время выполнения программы

// #### Вопросы о вводе информации в программу:

// 18. **Как в Java использовать класс Scanner для ввода информации от пользователя?**
//     - c) `Scanner scanner = new Scanner(System.in); String input = scanner.next();`

// // 19. **Как в Java использовать JOptionPane для ввода информации в программу?**
//     - c) `String input = JOptionPane.showInputDialog("Enter something:");`